---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ColorTemperature
source: html/30558769-d613-b651-f638-846866e0c7e7.htm
---
# Autodesk.Revit.DB.SpecTypeId.ColorTemperature Property

Color Temperature, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ColorTemperature { get; }
```